app/views/posts/show.html.erb


<% @post.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "comments" ON "users"."id" = "comments"."user_id" WHERE "comments"."post_id" = ?  [["post_id", 1]]